simulations/slip_top_and_bottom/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

/*
// Commented out for testing
inlet
	{
		type				fixedValue;
		value				uniform (1 0 0);
	}

*/


inlet
	{
		type            groovyBC;
		valueExpression "vector(1,0,0) - (2*pi*0.16*sin(2*pi*1.0*time()))*vector(0,1,0)";
		value uniform (1 0 0);  
	}



	outlet
	{
		type				inletOutlet;
		inletValue		uniform (0 0 0);
		value				$internalField;
	}

	ellipse
	{
		type				fixedValue;
		value				uniform (0 0 0);
	}

	topAndBottom
	{
		type				slip;
	}

	frontAndBack
	{
		type            empty;
	}

	defaultFaces
	{
		type            empty;
	}
}

// ************************************************************************* //
