simulations/slip_top_and_bottom/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions

{    forces

	{

		type        forceCoeffs;
		//type		forces;
		functionObjectLibs ( "libforces.so" );
		outputControl timeStep;
		outputInterval 1;
		patches		("ellipse");		
		pName       p;
		UName       U;
		rhoName		rhoInf;
		rhoInf      1;
		log         true;
		CofR        ( 0 0 0.25 );
		liftDir     ( -0. 0.9 0 );
		dragDir     ( 0.9 0. 0 );
		pitchAxis   ( 0 0 1 );
		magUInf     1.0;
			lRef        1;
			Aref        0.0981748;
			//Aref	    1;

	}

}

libs ( 
    "libOpenFOAM.so" 
    "libgroovyBC.so" 
    "libswakFunctionObjects.so"
    "libsimpleSwakFunctionObjects.so"
    "libfieldFunctionObjects.so"
) ;
// ************************************************************************* //
